constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          160;
        startFace       45040;
    }
    outlet
    {
        type            patch;
        nFaces          160;
        startFace       45200;
    }
    bottom
    {
        type            patch;
        nFaces          800;
        startFace       45360;
    }
    top
    {
        type            patch;
        nFaces          800;
        startFace       46160;
    }
    sideWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4000;
        startFace       46960;
    }
)

// ************************************************************************* //
